GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.inc
// Register: SPI2INTF
#define SPI2INTF SPI2INTF
SPI2INTF                                 equ 0097h
// bitfield definitions
SPI2INTF_TXUIF_POSN                      equ 0001h
SPI2INTF_TXUIF_POSITION                  equ 0001h
SPI2INTF_TXUIF_SIZE                      equ 0001h
SPI2INTF_TXUIF_LENGTH                    equ 0001h
SPI2INTF_TXUIF_MASK                      equ 0002h
SPI2INTF_RXOIF_POSN                      equ 0002h
SPI2INTF_RXOIF_POSITION                  equ 0002h
SPI2INTF_RXOIF_SIZE                      equ 0001h
SPI2INTF_RXOIF_LENGTH                    equ 0001h
SPI2INTF_RXOIF_MASK                      equ 0004h
SPI2INTF_EOSIF_POSN                      equ 0004h
SPI2INTF_EOSIF_POSITION                  equ 0004h
SPI2INTF_EOSIF_SIZE                      equ 0001h
SPI2INTF_EOSIF_LENGTH                    equ 0001h
SPI2INTF_EOSIF_MASK                      equ 0010h
SPI2INTF_SOSIF_POSN                      equ 0005h
SPI2INTF_SOSIF_POSITION                  equ 0005h
SPI2INTF_SOSIF_SIZE                      equ 0001h
SPI2INTF_SOSIF_LENGTH                    equ 0001h
SPI2INTF_SOSIF_MASK                      equ 0020h
SPI2INTF_TCZIF_POSN                      equ 0006h
SPI2INTF_TCZIF_POSITION                  equ 0006h
SPI2INTF_TCZIF_SIZE                      equ 0001h
SPI2INTF_TCZIF_LENGTH                    equ 0001h
SPI2INTF_TCZIF_MASK                      equ 0040h
SPI2INTF_SRMTIF_POSN                     equ 0007h
SPI2INTF_SRMTIF_POSITION                 equ 0007h
SPI2INTF_SRMTIF_SIZE                     equ 0001h
SPI2INTF_SRMTIF_LENGTH                   equ 0001h
SPI2INTF_SRMTIF_MASK                     equ 0080h
SPI2INTF_SPI2TXUIF_POSN                  equ 0001h
SPI2INTF_SPI2TXUIF_POSITION              equ 0001h
SPI2INTF_SPI2TXUIF_SIZE                  equ 0001h
SPI2INTF_SPI2TXUIF_LENGTH                equ 0001h
SPI2INTF_SPI2TXUIF_MASK                  equ 0002h
SPI2INTF_SPI2RXOIF_POSN                  equ 0002h
SPI2INTF_SPI2RXOIF_POSITION              equ 0002h
SPI2INTF_SPI2RXOIF_SIZE                  equ 0001h
SPI2INTF_SPI2RXOIF_LENGTH                equ 0001h
SPI2INTF_SPI2RXOIF_MASK                  equ 0004h
SPI2INTF_SPI2EOSIF_POSN                  equ 0004h
SPI2INTF_SPI2EOSIF_POSITION              equ 0004h
SPI2INTF_SPI2EOSIF_SIZE                  equ 0001h
SPI2INTF_SPI2EOSIF_LENGTH                equ 0001h
SPI2INTF_SPI2EOSIF_MASK                  equ 0010h
SPI2INTF_SPI2SOSIF_POSN                  equ 0005h
SPI2INTF_SPI2SOSIF_POSITION              equ 0005h
SPI2INTF_SPI2SOSIF_SIZE                  equ 0001h
SPI2INTF_SPI2SOSIF_LENGTH                equ 0001h
SPI2INTF_SPI2SOSIF_MASK                  equ 0020h
SPI2INTF_SPI2TCZIF_POSN                  equ 0006h
SPI2INTF_SPI2TCZIF_POSITION              equ 0006h
SPI2INTF_SPI2TCZIF_SIZE                  equ 0001h
SPI2INTF_SPI2TCZIF_LENGTH                equ 0001h
SPI2INTF_SPI2TCZIF_MASK                  equ 0040h
SPI2INTF_SPI2SRMTIF_POSN                 equ 0007h
SPI2INTF_SPI2SRMTIF_POSITION             equ 0007h
SPI2INTF_SPI2SRMTIF_SIZE                 equ 0001h
SPI2INTF_SPI2SRMTIF_LENGTH               equ 0001h
SPI2INTF_SPI2SRMTIF_MASK                 equ 0080h

// Register: SPI2INTE
#define SPI2INTE SPI2INTE
SPI2INTE                                 equ 0098h
// bitfield definitions
SPI2INTE_TXUIE_POSN                      equ 0001h
SPI2INTE_TXUIE_POSITION                  equ 0001h
SPI2INTE_TXUIE_SIZE                      equ 0001h
SPI2INTE_TXUIE_LENGTH                    equ 0001h
SPI2INTE_TXUIE_MASK                      equ 0002h
SPI2INTE_RXOIE_POSN                      equ 0002h
SPI2INTE_RXOIE_POSITION                  equ 0002h
SPI2INTE_RXOIE_SIZE                      equ 0001h
SPI2INTE_RXOIE_LENGTH                    equ 0001h
SPI2INTE_RXOIE_MASK                      equ 0004h
SPI2INTE_EOSIE_POSN                      equ 0004h
SPI2INTE_EOSIE_POSITION                  equ 0004h
SPI2INTE_EOSIE_SIZE                      equ 0001h
SPI2INTE_EOSIE_LENGTH                    equ 0001h
SPI2INTE_EOSIE_MASK                      equ 0010h
SPI2INTE_SOSIE_POSN                      equ 0005h
SPI2INTE_SOSIE_POSITION                  equ 0005h
SPI2INTE_SOSIE_SIZE                      equ 0001h
SPI2INTE_SOSIE_LENGTH                    equ 0001h
SPI2INTE_SOSIE_MASK                      equ 0020h
SPI2INTE_TCZIE_POSN                      equ 0006h
SPI2INTE_TCZIE_POSITION                  equ 0006h
SPI2INTE_TCZIE_SIZE                      equ 0001h
SPI2INTE_TCZIE_LENGTH                    equ 0001h
SPI2INTE_TCZIE_MASK                      equ 0040h
SPI2INTE_SRMTIE_POSN                     equ 0007h
SPI2INTE_SRMTIE_POSITION                 equ 0007h
SPI2INTE_SRMTIE_SIZE                     equ 0001h
SPI2INTE_SRMTIE_LENGTH                   equ 0001h
SPI2INTE_SRMTIE_MASK                     equ 0080h
SPI2INTE_SPI2TXUIE_POSN                  equ 0001h
SPI2INTE_SPI2TXUIE_POSITION              equ 0001h
SPI2INTE_SPI2TXUIE_SIZE                  equ 0001h
SPI2INTE_SPI2TXUIE_LENGTH                equ 0001h
SPI2INTE_SPI2TXUIE_MASK                  equ 0002h
SPI2INTE_SPI2RXOIE_POSN                  equ 0002h
SPI2INTE_SPI2RXOIE_POSITION              equ 0002h
SPI2INTE_SPI2RXOIE_SIZE                  equ 0001h
SPI2INTE_SPI2RXOIE_LENGTH                equ 0001h
SPI2INTE_SPI2RXOIE_MASK                  equ 0004h
SPI2INTE_SPI2EOSIE_POSN                  equ 0004h
SPI2INTE_SPI2EOSIE_POSITION              equ 0004h
SPI2INTE_SPI2EOSIE_SIZE                  equ 0001h
SPI2INTE_SPI2EOSIE_LENGTH                equ 0001h
SPI2INTE_SPI2EOSIE_MASK                  equ 0010h
SPI2INTE_SPI2SOSIE_POSN                  equ 0005h
SPI2INTE_SPI2SOSIE_POSITION              equ 0005h
SPI2INTE_SPI2SOSIE_SIZE                  equ 0001h
SPI2INTE_SPI2SOSIE_LENGTH                equ 0001h
SPI2INTE_SPI2SOSIE_MASK                  equ 0020h
SPI2INTE_SPI2TCZIE_POSN                  equ 0006h
SPI2INTE_SPI2TCZIE_POSITION              equ 0006h
SPI2INTE_SPI2TCZIE_SIZE                  equ 0001h
SPI2INTE_SPI2TCZIE_LENGTH                equ 0001h
SPI2INTE_SPI2TCZIE_MASK                  equ 0040h
SPI2INTE_SPI2SRMTIE_POSN                 equ 0007h
SPI2INTE_SPI2SRMTIE_POSITION             equ 0007h
SPI2INTE_SPI2SRMTIE_SIZE                 equ 0001h
SPI2INTE_SPI2SRMTIE_LENGTH               equ 0001h
SPI2INTE_SPI2SRMTIE_MASK                 equ 0080h

// Register: SPI2CLK
#define SPI2CLK SPI2CLK
SPI2CLK                                  equ 0099h
// bitfield definitions
SPI2CLK_CLKSEL_POSN                      equ 0000h
SPI2CLK_CLKSEL_POSITION                  equ 0000h
SPI2CLK_CLKSEL_SIZE                      equ 0008h
SPI2CLK_CLKSEL_LENGTH                    equ 0008h
SPI2CLK_CLKSEL_MASK                      equ 00FFh
SPI2CLK_CLKSEL0_POSN                     equ 0000h
SPI2CLK_CLKSEL0_POSITION                 equ 0000h
SPI2CLK_CLKSEL0_SIZE                     equ 0001h
SPI2CLK_CLKSEL0_LENGTH                   equ 0001h
SPI2CLK_CLKSEL0_MASK                     equ 0001h
SPI2CLK_CLKSEL1_POSN                     equ 0001h
SPI2CLK_CLKSEL1_POSITION                 equ 0001h
SPI2CLK_CLKSEL1_SIZE                     equ 0001h
SPI2CLK_CLKSEL1_LENGTH                   equ 0001h
SPI2CLK_CLKSEL1_MASK                     equ 0002h
SPI2CLK_CLKSEL2_POSN                     equ 0002h
SPI2CLK_CLKSEL2_POSITION                 equ 0002h
SPI2CLK_CLKSEL2_SIZE                     equ 0001h
SPI2CLK_CLKSEL2_LENGTH                   equ 0001h
SPI2CLK_CLKSEL2_MASK                     equ 0004h
SPI2CLK_CLKSEL3_POSN                     equ 0003h
SPI2CLK_CLKSEL3_POSITION                 equ 0003h
SPI2CLK_CLKSEL3_SIZE                     equ 0001h
SPI2CLK_CLKSEL3_LENGTH                   equ 0001h
SPI2CLK_CLKSEL3_MASK                     equ 0008h
SPI2CLK_SPI2CLKSEL_POSN                  equ 0000h
SPI2CLK_SPI2CLKSEL_POSITION              equ 0000h
SPI2CLK_SPI2CLKSEL_SIZE                  equ 0008h
SPI2CLK_SPI2CLKSEL_LENGTH                equ 0008h
SPI2CLK_SPI2CLKSEL_MASK                  equ 00FFh
SPI2CLK_SPI2CLKSEL0_POSN                 equ 0000h
SPI2CLK_SPI2CLKSEL0_POSITION             equ 0000h
SPI2CLK_SPI2CLKSEL0_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL0_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL0_MASK                 equ 0001h
SPI2CLK_SPI2CLKSEL1_POSN                 equ 0001h
SPI2CLK_SPI2CLKSEL1_POSITION             equ 0001h
SPI2CLK_SPI2CLKSEL1_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL1_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL1_MASK                 equ 0002h
SPI2CLK_SPI2CLKSEL2_POSN                 equ 0002h
SPI2CLK_SPI2CLKSEL2_POSITION             equ 0002h
SPI2CLK_SPI2CLKSEL2_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL2_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL2_MASK                 equ 0004h
SPI2CLK_SPI2CLKSEL3_POSN                 equ 0003h
SPI2CLK_SPI2CLKSEL3_POSITION             equ 0003h
SPI2CLK_SPI2CLKSEL3_SIZE                 equ 0001h
SPI2CLK_SPI2CLKSEL3_LENGTH               equ 0001h
SPI2CLK_SPI2CLKSEL3_MASK                 equ 0008h

// Register: DAC2DAT
#define DAC2DAT DAC2DAT
DAC2DAT                                  equ 00A0h

