GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.inc
// Register: DAC2DATL
#define DAC2DATL DAC2DATL
DAC2DATL                                 equ 00A0h
// bitfield definitions
DAC2DATL_DAC2R_POSN                      equ 0000h
DAC2DATL_DAC2R_POSITION                  equ 0000h
DAC2DATL_DAC2R_SIZE                      equ 0008h
DAC2DATL_DAC2R_LENGTH                    equ 0008h
DAC2DATL_DAC2R_MASK                      equ 00FFh
DAC2DATL_DAC2R0_POSN                     equ 0000h
DAC2DATL_DAC2R0_POSITION                 equ 0000h
DAC2DATL_DAC2R0_SIZE                     equ 0001h
DAC2DATL_DAC2R0_LENGTH                   equ 0001h
DAC2DATL_DAC2R0_MASK                     equ 0001h
DAC2DATL_DAC2R1_POSN                     equ 0001h
DAC2DATL_DAC2R1_POSITION                 equ 0001h
DAC2DATL_DAC2R1_SIZE                     equ 0001h
DAC2DATL_DAC2R1_LENGTH                   equ 0001h
DAC2DATL_DAC2R1_MASK                     equ 0002h
DAC2DATL_DAC2R2_POSN                     equ 0002h
DAC2DATL_DAC2R2_POSITION                 equ 0002h
DAC2DATL_DAC2R2_SIZE                     equ 0001h
DAC2DATL_DAC2R2_LENGTH                   equ 0001h
DAC2DATL_DAC2R2_MASK                     equ 0004h
DAC2DATL_DAC2R3_POSN                     equ 0003h
DAC2DATL_DAC2R3_POSITION                 equ 0003h
DAC2DATL_DAC2R3_SIZE                     equ 0001h
DAC2DATL_DAC2R3_LENGTH                   equ 0001h
DAC2DATL_DAC2R3_MASK                     equ 0008h
DAC2DATL_DAC2R4_POSN                     equ 0004h
DAC2DATL_DAC2R4_POSITION                 equ 0004h
DAC2DATL_DAC2R4_SIZE                     equ 0001h
DAC2DATL_DAC2R4_LENGTH                   equ 0001h
DAC2DATL_DAC2R4_MASK                     equ 0010h
DAC2DATL_DAC2R5_POSN                     equ 0005h
DAC2DATL_DAC2R5_POSITION                 equ 0005h
DAC2DATL_DAC2R5_SIZE                     equ 0001h
DAC2DATL_DAC2R5_LENGTH                   equ 0001h
DAC2DATL_DAC2R5_MASK                     equ 0020h
DAC2DATL_DAC2R6_POSN                     equ 0006h
DAC2DATL_DAC2R6_POSITION                 equ 0006h
DAC2DATL_DAC2R6_SIZE                     equ 0001h
DAC2DATL_DAC2R6_LENGTH                   equ 0001h
DAC2DATL_DAC2R6_MASK                     equ 0040h
DAC2DATL_DAC2R7_POSN                     equ 0007h
DAC2DATL_DAC2R7_POSITION                 equ 0007h
DAC2DATL_DAC2R7_SIZE                     equ 0001h
DAC2DATL_DAC2R7_LENGTH                   equ 0001h
DAC2DATL_DAC2R7_MASK                     equ 0080h
DAC2DATL_DAC2RL_POSN                     equ 0000h
DAC2DATL_DAC2RL_POSITION                 equ 0000h
DAC2DATL_DAC2RL_SIZE                     equ 0008h
DAC2DATL_DAC2RL_LENGTH                   equ 0008h
DAC2DATL_DAC2RL_MASK                     equ 00FFh

// Register: DAC2CON
#define DAC2CON DAC2CON
DAC2CON                                  equ 00A2h
// bitfield definitions
DAC2CON_NSS_POSN                         equ 0000h
DAC2CON_NSS_POSITION                     equ 0000h
DAC2CON_NSS_SIZE                         equ 0002h
DAC2CON_NSS_LENGTH                       equ 0002h
DAC2CON_NSS_MASK                         equ 0003h
DAC2CON_PSS_POSN                         equ 0002h
DAC2CON_PSS_POSITION                     equ 0002h
DAC2CON_PSS_SIZE                         equ 0002h
DAC2CON_PSS_LENGTH                       equ 0002h
DAC2CON_PSS_MASK                         equ 000Ch
DAC2CON_EN_POSN                          equ 0007h
DAC2CON_EN_POSITION                      equ 0007h
DAC2CON_EN_SIZE                          equ 0001h
DAC2CON_EN_LENGTH                        equ 0001h
DAC2CON_EN_MASK                          equ 0080h
DAC2CON_DAC2NSS_POSN                     equ 0000h
DAC2CON_DAC2NSS_POSITION                 equ 0000h
DAC2CON_DAC2NSS_SIZE                     equ 0002h
DAC2CON_DAC2NSS_LENGTH                   equ 0002h
DAC2CON_DAC2NSS_MASK                     equ 0003h
DAC2CON_DAC2PSS0_POSN                    equ 0002h
DAC2CON_DAC2PSS0_POSITION                equ 0002h
DAC2CON_DAC2PSS0_SIZE                    equ 0001h
DAC2CON_DAC2PSS0_LENGTH                  equ 0001h
DAC2CON_DAC2PSS0_MASK                    equ 0004h
DAC2CON_DAC2PSS1_POSN                    equ 0003h
DAC2CON_DAC2PSS1_POSITION                equ 0003h
DAC2CON_DAC2PSS1_SIZE                    equ 0001h
DAC2CON_DAC2PSS1_LENGTH                  equ 0001h
DAC2CON_DAC2PSS1_MASK                    equ 0008h
DAC2CON_DAC2EN_POSN                      equ 0007h
DAC2CON_DAC2EN_POSITION                  equ 0007h
DAC2CON_DAC2EN_SIZE                      equ 0001h
DAC2CON_DAC2EN_LENGTH                    equ 0001h
DAC2CON_DAC2EN_MASK                      equ 0080h
DAC2CON_NSS0_POSN                        equ 0000h
DAC2CON_NSS0_POSITION                    equ 0000h
DAC2CON_NSS0_SIZE                        equ 0001h
DAC2CON_NSS0_LENGTH                      equ 0001h
DAC2CON_NSS0_MASK                        equ 0001h
DAC2CON_PSS0_POSN                        equ 0002h
DAC2CON_PSS0_POSITION                    equ 0002h
DAC2CON_PSS0_SIZE                        equ 0001h
DAC2CON_PSS0_LENGTH                      equ 0001h
DAC2CON_PSS0_MASK                        equ 0004h
DAC2CON_PSS1_POSN                        equ 0003h
DAC2CON_PSS1_POSITION                    equ 0003h
DAC2CON_PSS1_SIZE                        equ 0001h
DAC2CON_PSS1_LENGTH                      equ 0001h
DAC2CON_PSS1_MASK                        equ 0008h

// Register: OPA1CON0
#define OPA1CON0 OPA1CON0
OPA1CON0                                 equ 00A3h
// bitfield definitions
OPA1CON0_SOC_POSN                        equ 0000h
OPA1CON0_SOC_POSITION                    equ 0000h
OPA1CON0_SOC_SIZE                        equ 0003h
OPA1CON0_SOC_LENGTH                      equ 0003h
OPA1CON0_SOC_MASK                        equ 0007h
OPA1CON0_UG_POSN                         equ 0003h
OPA1CON0_UG_POSITION                     equ 0003h
OPA1CON0_UG_SIZE                         equ 0001h
OPA1CON0_UG_LENGTH                       equ 0001h
OPA1CON0_UG_MASK                         equ 0008h
OPA1CON0_CPON_POSN                       equ 0005h
OPA1CON0_CPON_POSITION                   equ 0005h
OPA1CON0_CPON_SIZE                       equ 0001h
OPA1CON0_CPON_LENGTH                     equ 0001h
OPA1CON0_CPON_MASK                       equ 0020h
OPA1CON0_EN_POSN                         equ 0007h
OPA1CON0_EN_POSITION                     equ 0007h
OPA1CON0_EN_SIZE                         equ 0001h
OPA1CON0_EN_LENGTH                       equ 0001h
OPA1CON0_EN_MASK                         equ 0080h
OPA1CON0_SOC0_POSN                       equ 0000h
OPA1CON0_SOC0_POSITION                   equ 0000h
OPA1CON0_SOC0_SIZE                       equ 0001h
OPA1CON0_SOC0_LENGTH                     equ 0001h
OPA1CON0_SOC0_MASK                       equ 0001h
OPA1CON0_SOC1_POSN                       equ 0001h
OPA1CON0_SOC1_POSITION                   equ 0001h
OPA1CON0_SOC1_SIZE                       equ 0001h
OPA1CON0_SOC1_LENGTH                     equ 0001h
OPA1CON0_SOC1_MASK                       equ 0002h
OPA1CON0_SOC2_POSN                       equ 0002h
OPA1CON0_SOC2_POSITION                   equ 0002h
OPA1CON0_SOC2_SIZE                       equ 0001h
OPA1CON0_SOC2_LENGTH                     equ 0001h
OPA1CON0_SOC2_MASK                       equ 0004h
OPA1CON0_UG0_POSN                        equ 0003h
OPA1CON0_UG0_POSITION                    equ 0003h
OPA1CON0_UG0_SIZE                        equ 0001h
OPA1CON0_UG0_LENGTH                      equ 0001h
OPA1CON0_UG0_MASK                        equ 0008h
OPA1CON0_OPA1SOC_POSN                    equ 0000h
OPA1CON0_OPA1SOC_POSITION                equ 0000h
OPA1CON0_OPA1SOC_SIZE                    equ 0003h
OPA1CON0_OPA1SOC_LENGTH                  equ 0003h
OPA1CON0_OPA1SOC_MASK                    equ 0007h
OPA1CON0_OPA1UG_POSN                     equ 0003h
OPA1CON0_OPA1UG_POSITION                 equ 0003h
OPA1CON0_OPA1UG_SIZE                     equ 0001h
OPA1CON0_OPA1UG_LENGTH                   equ 0001h
OPA1CON0_OPA1UG_MASK                     equ 0008h
OPA1CON0_OPA1CPON_POSN                   equ 0005h
OPA1CON0_OPA1CPON_POSITION               equ 0005h
OPA1CON0_OPA1CPON_SIZE                   equ 0001h
OPA1CON0_OPA1CPON_LENGTH                 equ 0001h
OPA1CON0_OPA1CPON_MASK                   equ 0020h
OPA1CON0_OPA1EN_POSN                     equ 0007h
OPA1CON0_OPA1EN_POSITION                 equ 0007h
OPA1CON0_OPA1EN_SIZE                     equ 0001h
OPA1CON0_OPA1EN_LENGTH                   equ 0001h
OPA1CON0_OPA1EN_MASK                     equ 0080h
OPA1CON0_OPA1SOC0_POSN                   equ 0000h
OPA1CON0_OPA1SOC0_POSITION               equ 0000h
OPA1CON0_OPA1SOC0_SIZE                   equ 0001h
OPA1CON0_OPA1SOC0_LENGTH                 equ 0001h
OPA1CON0_OPA1SOC0_MASK                   equ 0001h
OPA1CON0_OPA1SOC1_POSN                   equ 0001h
OPA1CON0_OPA1SOC1_POSITION               equ 0001h
OPA1CON0_OPA1SOC1_SIZE                   equ 0001h
OPA1CON0_OPA1SOC1_LENGTH                 equ 0001h
OPA1CON0_OPA1SOC1_MASK                   equ 0002h
OPA1CON0_OPA1SOC2_POSN                   equ 0002h
OPA1CON0_OPA1SOC2_POSITION               equ 0002h
OPA1CON0_OPA1SOC2_SIZE                   equ 0001h
OPA1CON0_OPA1SOC2_LENGTH                 equ 0001h
OPA1CON0_OPA1SOC2_MASK                   equ 0004h

// Register: OPA1CON1
#define OPA1CON1 OPA1CON1
OPA1CON1                                 equ 00A4h
// bitfield definitions
OPA1CON1_NSS_POSN                        equ 0000h
OPA1CON1_NSS_POSITION                    equ 0000h
OPA1CON1_NSS_SIZE                        equ 0003h
OPA1CON1_NSS_LENGTH                      equ 0003h
OPA1CON1_NSS_MASK                        equ 0007h
OPA1CON1_RESON_POSN                      equ 0003h
OPA1CON1_RESON_POSITION                  equ 0003h
OPA1CON1_RESON_SIZE                      equ 0001h
OPA1CON1_RESON_LENGTH                    equ 0001h
OPA1CON1_RESON_MASK                      equ 0008h
OPA1CON1_GSEL_POSN                       equ 0004h
OPA1CON1_GSEL_POSITION                   equ 0004h
OPA1CON1_GSEL_SIZE                       equ 0003h
OPA1CON1_GSEL_LENGTH                     equ 0003h
OPA1CON1_GSEL_MASK                       equ 0070h
OPA1CON1_NSS0_POSN                       equ 0000h
OPA1CON1_NSS0_POSITION                   equ 0000h
OPA1CON1_NSS0_SIZE                       equ 0001h
OPA1CON1_NSS0_LENGTH                     equ 0001h
OPA1CON1_NSS0_MASK                       equ 0001h
OPA1CON1_NSS1_POSN                       equ 0001h
OPA1CON1_NSS1_POSITION                   equ 0001h
OPA1CON1_NSS1_SIZE                       equ 0001h
OPA1CON1_NSS1_LENGTH                     equ 0001h
OPA1CON1_NSS1_MASK                       equ 0002h
OPA1CON1_NSS2_POSN                       equ 0002h
OPA1CON1_NSS2_POSITION                   equ 0002h
OPA1CON1_NSS2_SIZE                       equ 0001h
OPA1CON1_NSS2_LENGTH                     equ 0001h
OPA1CON1_NSS2_MASK                       equ 0004h
OPA1CON1_GSEL0_POSN                      equ 0004h
OPA1CON1_GSEL0_POSITION                  equ 0004h
OPA1CON1_GSEL0_SIZE                      equ 0001h
OPA1CON1_GSEL0_LENGTH                    equ 0001h
OPA1CON1_GSEL0_MASK                      equ 0010h
OPA1CON1_GSEL1_POSN                      equ 0005h
OPA1CON1_GSEL1_POSITION                  equ 0005h
OPA1CON1_GSEL1_SIZE                      equ 0001h
OPA1CON1_GSEL1_LENGTH                    equ 0001h
OPA1CON1_GSEL1_MASK                      equ 0020h
OPA1CON1_GSEL2_POSN                      equ 0006h
OPA1CON1_GSEL2_POSITION                  equ 0006h
OPA1CON1_GSEL2_SIZE                      equ 0001h
OPA1CON1_GSEL2_LENGTH                    equ 0001h
OPA1CON1_GSEL2_MASK                      equ 0040h
OPA1CON1_OPA1NSS_POSN                    equ 0000h
OPA1CON1_OPA1NSS_POSITION                equ 0000h
OPA1CON1_OPA1NSS_SIZE                    equ 0003h
OPA1CON1_OPA1NSS_LENGTH                  equ 0003h
OPA1CON1_OPA1NSS_MASK                    equ 0007h
OPA1CON1_OPA1RESON_POSN                  equ 0003h
OPA1CON1_OPA1RESON_POSITION              equ 0003h
OPA1CON1_OPA1RESON_SIZE                  equ 0001h
OPA1CON1_OPA1RESON_LENGTH                equ 0001h
OPA1CON1_OPA1RESON_MASK                  equ 0008h
OPA1CON1_OPA1GSEL_POSN                   equ 0004h
OPA1CON1_OPA1GSEL_POSITION               equ 0004h
OPA1CON1_OPA1GSEL_SIZE                   equ 0003h
OPA1CON1_OPA1GSEL_LENGTH                 equ 0003h
OPA1CON1_OPA1GSEL_MASK                   equ 0070h
OPA1CON1_OPA1NSS0_POSN                   equ 0000h
OPA1CON1_OPA1NSS0_POSITION               equ 0000h
OPA1CON1_OPA1NSS0_SIZE                   equ 0001h
OPA1CON1_OPA1NSS0_LENGTH                 equ 0001h
OPA1CON1_OPA1NSS0_MASK                   equ 0001h
OPA1CON1_OPA1NSS1_POSN                   equ 0001h
OPA1CON1_OPA1NSS1_POSITION               equ 0001h
OPA1CON1_OPA1NSS1_SIZE                   equ 0001h
OPA1CON1_OPA1NSS1_LENGTH                 equ 0001h
OPA1CON1_OPA1NSS1_MASK                   equ 0002h
OPA1CON1_OPA1NSS2_POSN                   equ 0002h
OPA1CON1_OPA1NSS2_POSITION               equ 0002h
OPA1CON1_OPA1NSS2_SIZE                   equ 0001h
OPA1CON1_OPA1NSS2_LENGTH                 equ 0001h
OPA1CON1_OPA1NSS2_MASK                   equ 0004h
OPA1CON1_OPA1GSEL0_POSN                  equ 0004h
OPA1CON1_OPA1GSEL0_POSITION              equ 0004h
OPA1CON1_OPA1GSEL0_SIZE                  equ 0001h
OPA1CON1_OPA1GSEL0_LENGTH                equ 0001h
OPA1CON1_OPA1GSEL0_MASK                  equ 0010h
OPA1CON1_OPA1GSEL1_POSN                  equ 0005h
OPA1CON1_OPA1GSEL1_POSITION              equ 0005h
OPA1CON1_OPA1GSEL1_SIZE                  equ 0001h
OPA1CON1_OPA1GSEL1_LENGTH                equ 0001h
OPA1CON1_OPA1GSEL1_MASK                  equ 0020h
OPA1CON1_OPA1GSEL2_POSN                  equ 0006h
OPA1CON1_OPA1GSEL2_POSITION              equ 0006h
OPA1CON1_OPA1GSEL2_SIZE                  equ 0001h
OPA1CON1_OPA1GSEL2_LENGTH                equ 0001h
OPA1CON1_OPA1GSEL2_MASK                  equ 0040h

