GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.inc
// Register: U2RXPPS
#define U2RXPPS U2RXPPS
U2RXPPS                                  equ 0274h
// bitfield definitions
U2RXPPS_PIN_POSN                         equ 0000h
U2RXPPS_PIN_POSITION                     equ 0000h
U2RXPPS_PIN_SIZE                         equ 0003h
U2RXPPS_PIN_LENGTH                       equ 0003h
U2RXPPS_PIN_MASK                         equ 0007h
U2RXPPS_PORT_POSN                        equ 0003h
U2RXPPS_PORT_POSITION                    equ 0003h
U2RXPPS_PORT_SIZE                        equ 0003h
U2RXPPS_PORT_LENGTH                      equ 0003h
U2RXPPS_PORT_MASK                        equ 0038h
U2RXPPS_U2RXPPS_POSN                     equ 0000h
U2RXPPS_U2RXPPS_POSITION                 equ 0000h
U2RXPPS_U2RXPPS_SIZE                     equ 0006h
U2RXPPS_U2RXPPS_LENGTH                   equ 0006h
U2RXPPS_U2RXPPS_MASK                     equ 003Fh
U2RXPPS_U2RXPPS0_POSN                    equ 0000h
U2RXPPS_U2RXPPS0_POSITION                equ 0000h
U2RXPPS_U2RXPPS0_SIZE                    equ 0001h
U2RXPPS_U2RXPPS0_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS0_MASK                    equ 0001h
U2RXPPS_U2RXPPS1_POSN                    equ 0001h
U2RXPPS_U2RXPPS1_POSITION                equ 0001h
U2RXPPS_U2RXPPS1_SIZE                    equ 0001h
U2RXPPS_U2RXPPS1_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS1_MASK                    equ 0002h
U2RXPPS_U2RXPPS2_POSN                    equ 0002h
U2RXPPS_U2RXPPS2_POSITION                equ 0002h
U2RXPPS_U2RXPPS2_SIZE                    equ 0001h
U2RXPPS_U2RXPPS2_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS2_MASK                    equ 0004h
U2RXPPS_U2RXPPS3_POSN                    equ 0003h
U2RXPPS_U2RXPPS3_POSITION                equ 0003h
U2RXPPS_U2RXPPS3_SIZE                    equ 0001h
U2RXPPS_U2RXPPS3_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS3_MASK                    equ 0008h
U2RXPPS_U2RXPPS4_POSN                    equ 0004h
U2RXPPS_U2RXPPS4_POSITION                equ 0004h
U2RXPPS_U2RXPPS4_SIZE                    equ 0001h
U2RXPPS_U2RXPPS4_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS4_MASK                    equ 0010h
U2RXPPS_U2RXPPS5_POSN                    equ 0005h
U2RXPPS_U2RXPPS5_POSITION                equ 0005h
U2RXPPS_U2RXPPS5_SIZE                    equ 0001h
U2RXPPS_U2RXPPS5_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS5_MASK                    equ 0020h

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
U2CTSPPS                                 equ 0275h
// bitfield definitions
U2CTSPPS_PIN_POSN                        equ 0000h
U2CTSPPS_PIN_POSITION                    equ 0000h
U2CTSPPS_PIN_SIZE                        equ 0003h
U2CTSPPS_PIN_LENGTH                      equ 0003h
U2CTSPPS_PIN_MASK                        equ 0007h
U2CTSPPS_PORT_POSN                       equ 0003h
U2CTSPPS_PORT_POSITION                   equ 0003h
U2CTSPPS_PORT_SIZE                       equ 0003h
U2CTSPPS_PORT_LENGTH                     equ 0003h
U2CTSPPS_PORT_MASK                       equ 0038h
U2CTSPPS_U2CTSPPS_POSN                   equ 0000h
U2CTSPPS_U2CTSPPS_POSITION               equ 0000h
U2CTSPPS_U2CTSPPS_SIZE                   equ 0006h
U2CTSPPS_U2CTSPPS_LENGTH                 equ 0006h
U2CTSPPS_U2CTSPPS_MASK                   equ 003Fh
U2CTSPPS_U2CTSPPS0_POSN                  equ 0000h
U2CTSPPS_U2CTSPPS0_POSITION              equ 0000h
U2CTSPPS_U2CTSPPS0_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS0_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS0_MASK                  equ 0001h
U2CTSPPS_U2CTSPPS1_POSN                  equ 0001h
U2CTSPPS_U2CTSPPS1_POSITION              equ 0001h
U2CTSPPS_U2CTSPPS1_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS1_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS1_MASK                  equ 0002h
U2CTSPPS_U2CTSPPS2_POSN                  equ 0002h
U2CTSPPS_U2CTSPPS2_POSITION              equ 0002h
U2CTSPPS_U2CTSPPS2_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS2_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS2_MASK                  equ 0004h
U2CTSPPS_U2CTSPPS3_POSN                  equ 0003h
U2CTSPPS_U2CTSPPS3_POSITION              equ 0003h
U2CTSPPS_U2CTSPPS3_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS3_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS3_MASK                  equ 0008h
U2CTSPPS_U2CTSPPS4_POSN                  equ 0004h
U2CTSPPS_U2CTSPPS4_POSITION              equ 0004h
U2CTSPPS_U2CTSPPS4_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS4_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS4_MASK                  equ 0010h
U2CTSPPS_U2CTSPPS5_POSN                  equ 0005h
U2CTSPPS_U2CTSPPS5_POSITION              equ 0005h
U2CTSPPS_U2CTSPPS5_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS5_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS5_MASK                  equ 0020h

// Register: U3RXPPS
#define U3RXPPS U3RXPPS
U3RXPPS                                  equ 0276h
// bitfield definitions
U3RXPPS_PIN_POSN                         equ 0000h
U3RXPPS_PIN_POSITION                     equ 0000h
U3RXPPS_PIN_SIZE                         equ 0003h
U3RXPPS_PIN_LENGTH                       equ 0003h
U3RXPPS_PIN_MASK                         equ 0007h
U3RXPPS_PORT_POSN                        equ 0003h
U3RXPPS_PORT_POSITION                    equ 0003h
U3RXPPS_PORT_SIZE                        equ 0003h
U3RXPPS_PORT_LENGTH                      equ 0003h
U3RXPPS_PORT_MASK                        equ 0038h
U3RXPPS_U3RXPPS_POSN                     equ 0000h
U3RXPPS_U3RXPPS_POSITION                 equ 0000h
U3RXPPS_U3RXPPS_SIZE                     equ 0006h
U3RXPPS_U3RXPPS_LENGTH                   equ 0006h
U3RXPPS_U3RXPPS_MASK                     equ 003Fh
U3RXPPS_U3RXPPS0_POSN                    equ 0000h
U3RXPPS_U3RXPPS0_POSITION                equ 0000h
U3RXPPS_U3RXPPS0_SIZE                    equ 0001h
U3RXPPS_U3RXPPS0_LENGTH                  equ 0001h
U3RXPPS_U3RXPPS0_MASK                    equ 0001h
U3RXPPS_U3RXPPS1_POSN                    equ 0001h
U3RXPPS_U3RXPPS1_POSITION                equ 0001h
U3RXPPS_U3RXPPS1_SIZE                    equ 0001h
U3RXPPS_U3RXPPS1_LENGTH                  equ 0001h
U3RXPPS_U3RXPPS1_MASK                    equ 0002h
U3RXPPS_U3RXPPS2_POSN                    equ 0002h
U3RXPPS_U3RXPPS2_POSITION                equ 0002h
U3RXPPS_U3RXPPS2_SIZE                    equ 0001h
U3RXPPS_U3RXPPS2_LENGTH                  equ 0001h
U3RXPPS_U3RXPPS2_MASK                    equ 0004h
U3RXPPS_U3RXPPS3_POSN                    equ 0003h
U3RXPPS_U3RXPPS3_POSITION                equ 0003h
U3RXPPS_U3RXPPS3_SIZE                    equ 0001h
U3RXPPS_U3RXPPS3_LENGTH                  equ 0001h
U3RXPPS_U3RXPPS3_MASK                    equ 0008h
U3RXPPS_U3RXPPS4_POSN                    equ 0004h
U3RXPPS_U3RXPPS4_POSITION                equ 0004h
U3RXPPS_U3RXPPS4_SIZE                    equ 0001h
U3RXPPS_U3RXPPS4_LENGTH                  equ 0001h
U3RXPPS_U3RXPPS4_MASK                    equ 0010h
U3RXPPS_U3RXPPS5_POSN                    equ 0005h
U3RXPPS_U3RXPPS5_POSITION                equ 0005h
U3RXPPS_U3RXPPS5_SIZE                    equ 0001h
U3RXPPS_U3RXPPS5_LENGTH                  equ 0001h
U3RXPPS_U3RXPPS5_MASK                    equ 0020h

// Register: U3CTSPPS
#define U3CTSPPS U3CTSPPS
U3CTSPPS                                 equ 0277h
// bitfield definitions
U3CTSPPS_PIN_POSN                        equ 0000h
U3CTSPPS_PIN_POSITION                    equ 0000h
U3CTSPPS_PIN_SIZE                        equ 0003h
U3CTSPPS_PIN_LENGTH                      equ 0003h
U3CTSPPS_PIN_MASK                        equ 0007h
U3CTSPPS_PORT_POSN                       equ 0003h
U3CTSPPS_PORT_POSITION                   equ 0003h
U3CTSPPS_PORT_SIZE                       equ 0003h
U3CTSPPS_PORT_LENGTH                     equ 0003h
U3CTSPPS_PORT_MASK                       equ 0038h
U3CTSPPS_U3CTSPPS_POSN                   equ 0000h
U3CTSPPS_U3CTSPPS_POSITION               equ 0000h
U3CTSPPS_U3CTSPPS_SIZE                   equ 0006h
U3CTSPPS_U3CTSPPS_LENGTH                 equ 0006h
U3CTSPPS_U3CTSPPS_MASK                   equ 003Fh
U3CTSPPS_U3CTSPPS0_POSN                  equ 0000h
U3CTSPPS_U3CTSPPS0_POSITION              equ 0000h
U3CTSPPS_U3CTSPPS0_SIZE                  equ 0001h
U3CTSPPS_U3CTSPPS0_LENGTH                equ 0001h
U3CTSPPS_U3CTSPPS0_MASK                  equ 0001h
U3CTSPPS_U3CTSPPS1_POSN                  equ 0001h
U3CTSPPS_U3CTSPPS1_POSITION              equ 0001h
U3CTSPPS_U3CTSPPS1_SIZE                  equ 0001h
U3CTSPPS_U3CTSPPS1_LENGTH                equ 0001h
U3CTSPPS_U3CTSPPS1_MASK                  equ 0002h
U3CTSPPS_U3CTSPPS2_POSN                  equ 0002h
U3CTSPPS_U3CTSPPS2_POSITION              equ 0002h
U3CTSPPS_U3CTSPPS2_SIZE                  equ 0001h
U3CTSPPS_U3CTSPPS2_LENGTH                equ 0001h
U3CTSPPS_U3CTSPPS2_MASK                  equ 0004h
U3CTSPPS_U3CTSPPS3_POSN                  equ 0003h
U3CTSPPS_U3CTSPPS3_POSITION              equ 0003h
U3CTSPPS_U3CTSPPS3_SIZE                  equ 0001h
U3CTSPPS_U3CTSPPS3_LENGTH                equ 0001h
U3CTSPPS_U3CTSPPS3_MASK                  equ 0008h
U3CTSPPS_U3CTSPPS4_POSN                  equ 0004h
U3CTSPPS_U3CTSPPS4_POSITION              equ 0004h
U3CTSPPS_U3CTSPPS4_SIZE                  equ 0001h
U3CTSPPS_U3CTSPPS4_LENGTH                equ 0001h
U3CTSPPS_U3CTSPPS4_MASK                  equ 0010h
U3CTSPPS_U3CTSPPS5_POSN                  equ 0005h
U3CTSPPS_U3CTSPPS5_POSITION              equ 0005h
U3CTSPPS_U3CTSPPS5_SIZE                  equ 0001h
U3CTSPPS_U3CTSPPS5_LENGTH                equ 0001h
U3CTSPPS_U3CTSPPS5_MASK                  equ 0020h

// Register: RC1I2C
#define RC1I2C RC1I2C
RC1I2C                                   equ 0288h
// bitfield definitions
RC1I2C_TH_POSN                           equ 0000h
RC1I2C_TH_POSITION                       equ 0000h
RC1I2C_TH_SIZE                           equ 0002h
RC1I2C_TH_LENGTH                         equ 0002h
RC1I2C_TH_MASK                           equ 0003h
RC1I2C_PU_POSN                           equ 0004h
RC1I2C_PU_POSITION                       equ 0004h
RC1I2C_PU_SIZE                           equ 0002h
RC1I2C_PU_LENGTH                         equ 0002h
RC1I2C_PU_MASK                           equ 0030h
RC1I2C_SLEW_POSN                         equ 0006h
RC1I2C_SLEW_POSITION                     equ 0006h
RC1I2C_SLEW_SIZE                         equ 0002h
RC1I2C_SLEW_LENGTH                       equ 0002h
RC1I2C_SLEW_MASK                         equ 00C0h
RC1I2C_TH0_POSN                          equ 0000h
RC1I2C_TH0_POSITION                      equ 0000h
RC1I2C_TH0_SIZE                          equ 0001h
RC1I2C_TH0_LENGTH                        equ 0001h
RC1I2C_TH0_MASK                          equ 0001h
RC1I2C_TH1_POSN                          equ 0001h
RC1I2C_TH1_POSITION                      equ 0001h
RC1I2C_TH1_SIZE                          equ 0001h
RC1I2C_TH1_LENGTH                        equ 0001h
RC1I2C_TH1_MASK                          equ 0002h
RC1I2C_PU0_POSN                          equ 0004h
RC1I2C_PU0_POSITION                      equ 0004h
RC1I2C_PU0_SIZE                          equ 0001h
RC1I2C_PU0_LENGTH                        equ 0001h
RC1I2C_PU0_MASK                          equ 0010h
RC1I2C_PU1_POSN                          equ 0005h
RC1I2C_PU1_POSITION                      equ 0005h
RC1I2C_PU1_SIZE                          equ 0001h
RC1I2C_PU1_LENGTH                        equ 0001h
RC1I2C_PU1_MASK                          equ 0020h
RC1I2C_SLEW0_POSN                        equ 0006h
RC1I2C_SLEW0_POSITION                    equ 0006h
RC1I2C_SLEW0_SIZE                        equ 0001h
RC1I2C_SLEW0_LENGTH                      equ 0001h
RC1I2C_SLEW0_MASK                        equ 0040h
RC1I2C_SLEW1_POSN                        equ 0007h
RC1I2C_SLEW1_POSITION                    equ 0007h
RC1I2C_SLEW1_SIZE                        equ 0001h
RC1I2C_SLEW1_LENGTH                      equ 0001h
RC1I2C_SLEW1_MASK                        equ 0080h
RC1I2C_I2CTH_POSN                        equ 0000h
RC1I2C_I2CTH_POSITION                    equ 0000h
RC1I2C_I2CTH_SIZE                        equ 0002h
RC1I2C_I2CTH_LENGTH                      equ 0002h
RC1I2C_I2CTH_MASK                        equ 0003h
RC1I2C_I2CPU_POSN                        equ 0004h
RC1I2C_I2CPU_POSITION                    equ 0004h
RC1I2C_I2CPU_SIZE                        equ 0002h
RC1I2C_I2CPU_LENGTH                      equ 0002h
RC1I2C_I2CPU_MASK                        equ 0030h
RC1I2C_I2CSLEW_POSN                      equ 0006h
RC1I2C_I2CSLEW_POSITION                  equ 0006h
RC1I2C_I2CSLEW_SIZE                      equ 0002h
RC1I2C_I2CSLEW_LENGTH                    equ 0002h
RC1I2C_I2CSLEW_MASK                      equ 00C0h
RC1I2C_I2CTH0_POSN                       equ 0000h
RC1I2C_I2CTH0_POSITION                   equ 0000h
RC1I2C_I2CTH0_SIZE                       equ 0001h
RC1I2C_I2CTH0_LENGTH                     equ 0001h
RC1I2C_I2CTH0_MASK                       equ 0001h
RC1I2C_I2CTH1_POSN                       equ 0001h
RC1I2C_I2CTH1_POSITION                   equ 0001h
RC1I2C_I2CTH1_SIZE                       equ 0001h
RC1I2C_I2CTH1_LENGTH                     equ 0001h
RC1I2C_I2CTH1_MASK                       equ 0002h
RC1I2C_I2CPU0_POSN                       equ 0004h
RC1I2C_I2CPU0_POSITION                   equ 0004h
RC1I2C_I2CPU0_SIZE                       equ 0001h
RC1I2C_I2CPU0_LENGTH                     equ 0001h
RC1I2C_I2CPU0_MASK                       equ 0010h
RC1I2C_I2CPU1_POSN                       equ 0005h
RC1I2C_I2CPU1_POSITION                   equ 0005h
RC1I2C_I2CPU1_SIZE                       equ 0001h
RC1I2C_I2CPU1_LENGTH                     equ 0001h
RC1I2C_I2CPU1_MASK                       equ 0020h
RC1I2C_I2CSLEW0_POSN                     equ 0006h
RC1I2C_I2CSLEW0_POSITION                 equ 0006h
RC1I2C_I2CSLEW0_SIZE                     equ 0001h
RC1I2C_I2CSLEW0_LENGTH                   equ 0001h
RC1I2C_I2CSLEW0_MASK                     equ 0040h
RC1I2C_I2CSLEW1_POSN                     equ 0007h
RC1I2C_I2CSLEW1_POSITION                 equ 0007h
RC1I2C_I2CSLEW1_SIZE                     equ 0001h
RC1I2C_I2CSLEW1_LENGTH                   equ 0001h
RC1I2C_I2CSLEW1_MASK                     equ 0080h

