GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.inc
// Register: U3ERRIE
#define U3ERRIE U3ERRIE
U3ERRIE                                  equ 02D9h
// bitfield definitions
U3ERRIE_TXCIE_POSN                       equ 0000h
U3ERRIE_TXCIE_POSITION                   equ 0000h
U3ERRIE_TXCIE_SIZE                       equ 0001h
U3ERRIE_TXCIE_LENGTH                     equ 0001h
U3ERRIE_TXCIE_MASK                       equ 0001h
U3ERRIE_RXFOIE_POSN                      equ 0001h
U3ERRIE_RXFOIE_POSITION                  equ 0001h
U3ERRIE_RXFOIE_SIZE                      equ 0001h
U3ERRIE_RXFOIE_LENGTH                    equ 0001h
U3ERRIE_RXFOIE_MASK                      equ 0002h
U3ERRIE_RXBKIE_POSN                      equ 0002h
U3ERRIE_RXBKIE_POSITION                  equ 0002h
U3ERRIE_RXBKIE_SIZE                      equ 0001h
U3ERRIE_RXBKIE_LENGTH                    equ 0001h
U3ERRIE_RXBKIE_MASK                      equ 0004h
U3ERRIE_FERIE_POSN                       equ 0003h
U3ERRIE_FERIE_POSITION                   equ 0003h
U3ERRIE_FERIE_SIZE                       equ 0001h
U3ERRIE_FERIE_LENGTH                     equ 0001h
U3ERRIE_FERIE_MASK                       equ 0008h
U3ERRIE_CERIE_POSN                       equ 0004h
U3ERRIE_CERIE_POSITION                   equ 0004h
U3ERRIE_CERIE_SIZE                       equ 0001h
U3ERRIE_CERIE_LENGTH                     equ 0001h
U3ERRIE_CERIE_MASK                       equ 0010h
U3ERRIE_ABDOVE_POSN                      equ 0005h
U3ERRIE_ABDOVE_POSITION                  equ 0005h
U3ERRIE_ABDOVE_SIZE                      equ 0001h
U3ERRIE_ABDOVE_LENGTH                    equ 0001h
U3ERRIE_ABDOVE_MASK                      equ 0020h
U3ERRIE_PERIE_POSN                       equ 0006h
U3ERRIE_PERIE_POSITION                   equ 0006h
U3ERRIE_PERIE_SIZE                       equ 0001h
U3ERRIE_PERIE_LENGTH                     equ 0001h
U3ERRIE_PERIE_MASK                       equ 0040h
U3ERRIE_TXMTIE_POSN                      equ 0007h
U3ERRIE_TXMTIE_POSITION                  equ 0007h
U3ERRIE_TXMTIE_SIZE                      equ 0001h
U3ERRIE_TXMTIE_LENGTH                    equ 0001h
U3ERRIE_TXMTIE_MASK                      equ 0080h
U3ERRIE_U3TXCIE_POSN                     equ 0000h
U3ERRIE_U3TXCIE_POSITION                 equ 0000h
U3ERRIE_U3TXCIE_SIZE                     equ 0001h
U3ERRIE_U3TXCIE_LENGTH                   equ 0001h
U3ERRIE_U3TXCIE_MASK                     equ 0001h
U3ERRIE_U3RXFOIE_POSN                    equ 0001h
U3ERRIE_U3RXFOIE_POSITION                equ 0001h
U3ERRIE_U3RXFOIE_SIZE                    equ 0001h
U3ERRIE_U3RXFOIE_LENGTH                  equ 0001h
U3ERRIE_U3RXFOIE_MASK                    equ 0002h
U3ERRIE_U3RXBKIE_POSN                    equ 0002h
U3ERRIE_U3RXBKIE_POSITION                equ 0002h
U3ERRIE_U3RXBKIE_SIZE                    equ 0001h
U3ERRIE_U3RXBKIE_LENGTH                  equ 0001h
U3ERRIE_U3RXBKIE_MASK                    equ 0004h
U3ERRIE_U3FERIE_POSN                     equ 0003h
U3ERRIE_U3FERIE_POSITION                 equ 0003h
U3ERRIE_U3FERIE_SIZE                     equ 0001h
U3ERRIE_U3FERIE_LENGTH                   equ 0001h
U3ERRIE_U3FERIE_MASK                     equ 0008h
U3ERRIE_U3CERIE_POSN                     equ 0004h
U3ERRIE_U3CERIE_POSITION                 equ 0004h
U3ERRIE_U3CERIE_SIZE                     equ 0001h
U3ERRIE_U3CERIE_LENGTH                   equ 0001h
U3ERRIE_U3CERIE_MASK                     equ 0010h
U3ERRIE_U3ABDOVE_POSN                    equ 0005h
U3ERRIE_U3ABDOVE_POSITION                equ 0005h
U3ERRIE_U3ABDOVE_SIZE                    equ 0001h
U3ERRIE_U3ABDOVE_LENGTH                  equ 0001h
U3ERRIE_U3ABDOVE_MASK                    equ 0020h
U3ERRIE_U3PERIE_POSN                     equ 0006h
U3ERRIE_U3PERIE_POSITION                 equ 0006h
U3ERRIE_U3PERIE_SIZE                     equ 0001h
U3ERRIE_U3PERIE_LENGTH                   equ 0001h
U3ERRIE_U3PERIE_MASK                     equ 0040h
U3ERRIE_U3TXMTIE_POSN                    equ 0007h
U3ERRIE_U3TXMTIE_POSITION                equ 0007h
U3ERRIE_U3TXMTIE_SIZE                    equ 0001h
U3ERRIE_U3TXMTIE_LENGTH                  equ 0001h
U3ERRIE_U3TXMTIE_MASK                    equ 0080h

// Register: SMT1TMR
#define SMT1TMR SMT1TMR
SMT1TMR                                  equ 0300h

// Register: SMT1TMRL
#define SMT1TMRL SMT1TMRL
SMT1TMRL                                 equ 0300h
// bitfield definitions
SMT1TMRL_SMT1TMR_POSN                    equ 0000h
SMT1TMRL_SMT1TMR_POSITION                equ 0000h
SMT1TMRL_SMT1TMR_SIZE                    equ 0008h
SMT1TMRL_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRL_SMT1TMR_MASK                    equ 00FFh
SMT1TMRL_SMT1TMR0_POSN                   equ 0000h
SMT1TMRL_SMT1TMR0_POSITION               equ 0000h
SMT1TMRL_SMT1TMR0_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR0_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR0_MASK                   equ 0001h
SMT1TMRL_SMT1TMR1_POSN                   equ 0001h
SMT1TMRL_SMT1TMR1_POSITION               equ 0001h
SMT1TMRL_SMT1TMR1_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR1_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR1_MASK                   equ 0002h
SMT1TMRL_SMT1TMR2_POSN                   equ 0002h
SMT1TMRL_SMT1TMR2_POSITION               equ 0002h
SMT1TMRL_SMT1TMR2_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR2_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR2_MASK                   equ 0004h
SMT1TMRL_SMT1TMR3_POSN                   equ 0003h
SMT1TMRL_SMT1TMR3_POSITION               equ 0003h
SMT1TMRL_SMT1TMR3_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR3_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR3_MASK                   equ 0008h
SMT1TMRL_SMT1TMR4_POSN                   equ 0004h
SMT1TMRL_SMT1TMR4_POSITION               equ 0004h
SMT1TMRL_SMT1TMR4_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR4_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR4_MASK                   equ 0010h
SMT1TMRL_SMT1TMR5_POSN                   equ 0005h
SMT1TMRL_SMT1TMR5_POSITION               equ 0005h
SMT1TMRL_SMT1TMR5_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR5_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR5_MASK                   equ 0020h
SMT1TMRL_SMT1TMR6_POSN                   equ 0006h
SMT1TMRL_SMT1TMR6_POSITION               equ 0006h
SMT1TMRL_SMT1TMR6_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR6_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR6_MASK                   equ 0040h
SMT1TMRL_SMT1TMR7_POSN                   equ 0007h
SMT1TMRL_SMT1TMR7_POSITION               equ 0007h
SMT1TMRL_SMT1TMR7_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR7_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR7_MASK                   equ 0080h

// Register: SMT1TMRH
#define SMT1TMRH SMT1TMRH
SMT1TMRH                                 equ 0301h
// bitfield definitions
SMT1TMRH_SMT1TMR_POSN                    equ 0000h
SMT1TMRH_SMT1TMR_POSITION                equ 0000h
SMT1TMRH_SMT1TMR_SIZE                    equ 0008h
SMT1TMRH_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRH_SMT1TMR_MASK                    equ 00FFh
SMT1TMRH_SMT1TMR8_POSN                   equ 0000h
SMT1TMRH_SMT1TMR8_POSITION               equ 0000h
SMT1TMRH_SMT1TMR8_SIZE                   equ 0001h
SMT1TMRH_SMT1TMR8_LENGTH                 equ 0001h
SMT1TMRH_SMT1TMR8_MASK                   equ 0001h
SMT1TMRH_SMT1TMR9_POSN                   equ 0001h
SMT1TMRH_SMT1TMR9_POSITION               equ 0001h
SMT1TMRH_SMT1TMR9_SIZE                   equ 0001h
SMT1TMRH_SMT1TMR9_LENGTH                 equ 0001h
SMT1TMRH_SMT1TMR9_MASK                   equ 0002h
SMT1TMRH_SMT1TMR10_POSN                  equ 0002h
SMT1TMRH_SMT1TMR10_POSITION              equ 0002h
SMT1TMRH_SMT1TMR10_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR10_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR10_MASK                  equ 0004h
SMT1TMRH_SMT1TMR11_POSN                  equ 0003h
SMT1TMRH_SMT1TMR11_POSITION              equ 0003h
SMT1TMRH_SMT1TMR11_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR11_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR11_MASK                  equ 0008h
SMT1TMRH_SMT1TMR12_POSN                  equ 0004h
SMT1TMRH_SMT1TMR12_POSITION              equ 0004h
SMT1TMRH_SMT1TMR12_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR12_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR12_MASK                  equ 0010h
SMT1TMRH_SMT1TMR13_POSN                  equ 0005h
SMT1TMRH_SMT1TMR13_POSITION              equ 0005h
SMT1TMRH_SMT1TMR13_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR13_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR13_MASK                  equ 0020h
SMT1TMRH_SMT1TMR14_POSN                  equ 0006h
SMT1TMRH_SMT1TMR14_POSITION              equ 0006h
SMT1TMRH_SMT1TMR14_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR14_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR14_MASK                  equ 0040h
SMT1TMRH_SMT1TMR15_POSN                  equ 0007h
SMT1TMRH_SMT1TMR15_POSITION              equ 0007h
SMT1TMRH_SMT1TMR15_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR15_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR15_MASK                  equ 0080h

