GopalSaraf/Practicals/PSDL/include/proc/pic18f04q41.inc
// Register: BSR
#define BSR BSR
BSR                                      equ 04E0h

// Register: FSR1
#define FSR1 FSR1
FSR1                                     equ 04E1h

// Register: FSR1L
#define FSR1L FSR1L
FSR1L                                    equ 04E1h
// bitfield definitions
FSR1L_FSR1L_POSN                         equ 0000h
FSR1L_FSR1L_POSITION                     equ 0000h
FSR1L_FSR1L_SIZE                         equ 0008h
FSR1L_FSR1L_LENGTH                       equ 0008h
FSR1L_FSR1L_MASK                         equ 00FFh

// Register: FSR1H
#define FSR1H FSR1H
FSR1H                                    equ 04E2h
// bitfield definitions
FSR1H_FSR1H_POSN                         equ 0000h
FSR1H_FSR1H_POSITION                     equ 0000h
FSR1H_FSR1H_SIZE                         equ 0006h
FSR1H_FSR1H_LENGTH                       equ 0006h
FSR1H_FSR1H_MASK                         equ 003Fh

// Register: PLUSW1
#define PLUSW1 PLUSW1
PLUSW1                                   equ 04E3h
// bitfield definitions
PLUSW1_PLUSW1_POSN                       equ 0000h
PLUSW1_PLUSW1_POSITION                   equ 0000h
PLUSW1_PLUSW1_SIZE                       equ 0008h
PLUSW1_PLUSW1_LENGTH                     equ 0008h
PLUSW1_PLUSW1_MASK                       equ 00FFh

// Register: PREINC1
#define PREINC1 PREINC1
PREINC1                                  equ 04E4h
// bitfield definitions
PREINC1_PREINC1_POSN                     equ 0000h
PREINC1_PREINC1_POSITION                 equ 0000h
PREINC1_PREINC1_SIZE                     equ 0008h
PREINC1_PREINC1_LENGTH                   equ 0008h
PREINC1_PREINC1_MASK                     equ 00FFh

// Register: POSTDEC1
#define POSTDEC1 POSTDEC1
POSTDEC1                                 equ 04E5h
// bitfield definitions
POSTDEC1_POSTDEC1_POSN                   equ 0000h
POSTDEC1_POSTDEC1_POSITION               equ 0000h
POSTDEC1_POSTDEC1_SIZE                   equ 0008h
POSTDEC1_POSTDEC1_LENGTH                 equ 0008h
POSTDEC1_POSTDEC1_MASK                   equ 00FFh

// Register: POSTINC1
#define POSTINC1 POSTINC1
POSTINC1                                 equ 04E6h
// bitfield definitions
POSTINC1_POSTINC1_POSN                   equ 0000h
POSTINC1_POSTINC1_POSITION               equ 0000h
POSTINC1_POSTINC1_SIZE                   equ 0008h
POSTINC1_POSTINC1_LENGTH                 equ 0008h
POSTINC1_POSTINC1_MASK                   equ 00FFh

// Register: INDF1
#define INDF1 INDF1
INDF1                                    equ 04E7h
// bitfield definitions
INDF1_INDF1_POSN                         equ 0000h
INDF1_INDF1_POSITION                     equ 0000h
INDF1_INDF1_SIZE                         equ 0008h
INDF1_INDF1_LENGTH                       equ 0008h
INDF1_INDF1_MASK                         equ 00FFh

// Register: WREG
#define WREG WREG
WREG                                     equ 04E8h
// bitfield definitions
WREG_WREG_POSN                           equ 0000h
WREG_WREG_POSITION                       equ 0000h
WREG_WREG_SIZE                           equ 0008h
WREG_WREG_LENGTH                         equ 0008h
WREG_WREG_MASK                           equ 00FFh

// Register: FSR0
#define FSR0 FSR0
FSR0                                     equ 04E9h

// Register: FSR0L
#define FSR0L FSR0L
FSR0L                                    equ 04E9h
// bitfield definitions
FSR0L_FSR0L_POSN                         equ 0000h
FSR0L_FSR0L_POSITION                     equ 0000h
FSR0L_FSR0L_SIZE                         equ 0008h
FSR0L_FSR0L_LENGTH                       equ 0008h
FSR0L_FSR0L_MASK                         equ 00FFh

// Register: FSR0H
#define FSR0H FSR0H
FSR0H                                    equ 04EAh
// bitfield definitions
FSR0H_FSR0H_POSN                         equ 0000h
FSR0H_FSR0H_POSITION                     equ 0000h
FSR0H_FSR0H_SIZE                         equ 0006h
FSR0H_FSR0H_LENGTH                       equ 0006h
FSR0H_FSR0H_MASK                         equ 003Fh

// Register: PLUSW0
#define PLUSW0 PLUSW0
PLUSW0                                   equ 04EBh
// bitfield definitions
PLUSW0_PLUSW0_POSN                       equ 0000h
PLUSW0_PLUSW0_POSITION                   equ 0000h
PLUSW0_PLUSW0_SIZE                       equ 0008h
PLUSW0_PLUSW0_LENGTH                     equ 0008h
PLUSW0_PLUSW0_MASK                       equ 00FFh

// Register: PREINC0
#define PREINC0 PREINC0
PREINC0                                  equ 04ECh
// bitfield definitions
PREINC0_PREINC0_POSN                     equ 0000h
PREINC0_PREINC0_POSITION                 equ 0000h
PREINC0_PREINC0_SIZE                     equ 0008h
PREINC0_PREINC0_LENGTH                   equ 0008h
PREINC0_PREINC0_MASK                     equ 00FFh

// Register: POSTDEC0
#define POSTDEC0 POSTDEC0
POSTDEC0                                 equ 04EDh
// bitfield definitions
POSTDEC0_POSTDEC0_POSN                   equ 0000h
POSTDEC0_POSTDEC0_POSITION               equ 0000h
POSTDEC0_POSTDEC0_SIZE                   equ 0008h
POSTDEC0_POSTDEC0_LENGTH                 equ 0008h
POSTDEC0_POSTDEC0_MASK                   equ 00FFh

// Register: POSTINC0
#define POSTINC0 POSTINC0
POSTINC0                                 equ 04EEh
// bitfield definitions
POSTINC0_POSTINC0_POSN                   equ 0000h
POSTINC0_POSTINC0_POSITION               equ 0000h
POSTINC0_POSTINC0_SIZE                   equ 0008h
POSTINC0_POSTINC0_LENGTH                 equ 0008h
POSTINC0_POSTINC0_MASK                   equ 00FFh

// Register: INDF0
#define INDF0 INDF0
INDF0                                    equ 04EFh
// bitfield definitions
INDF0_INDF0_POSN                         equ 0000h
INDF0_INDF0_POSITION                     equ 0000h
INDF0_INDF0_SIZE                         equ 0008h
INDF0_INDF0_LENGTH                       equ 0008h
INDF0_INDF0_MASK                         equ 00FFh

// Register: PCON0
#define PCON0 PCON0
PCON0                                    equ 04F0h
// bitfield definitions
PCON0_NOT_BOR_POSN                       equ 0000h
PCON0_NOT_BOR_POSITION                   equ 0000h
PCON0_NOT_BOR_SIZE                       equ 0001h
PCON0_NOT_BOR_LENGTH                     equ 0001h
PCON0_NOT_BOR_MASK                       equ 0001h
PCON0_NOT_POR_POSN                       equ 0001h
PCON0_NOT_POR_POSITION                   equ 0001h
PCON0_NOT_POR_SIZE                       equ 0001h
PCON0_NOT_POR_LENGTH                     equ 0001h
PCON0_NOT_POR_MASK                       equ 0002h
PCON0_NOT_RI_POSN                        equ 0002h
PCON0_NOT_RI_POSITION                    equ 0002h
PCON0_NOT_RI_SIZE                        equ 0001h
PCON0_NOT_RI_LENGTH                      equ 0001h
PCON0_NOT_RI_MASK                        equ 0004h
PCON0_NOT_RMCLR_POSN                     equ 0003h
PCON0_NOT_RMCLR_POSITION                 equ 0003h
PCON0_NOT_RMCLR_SIZE                     equ 0001h
PCON0_NOT_RMCLR_LENGTH                   equ 0001h
PCON0_NOT_RMCLR_MASK                     equ 0008h
PCON0_NOT_RWDT_POSN                      equ 0004h
PCON0_NOT_RWDT_POSITION                  equ 0004h
PCON0_NOT_RWDT_SIZE                      equ 0001h
PCON0_NOT_RWDT_LENGTH                    equ 0001h
PCON0_NOT_RWDT_MASK                      equ 0010h
PCON0_NOT_WDTWV_POSN                     equ 0005h
PCON0_NOT_WDTWV_POSITION                 equ 0005h
PCON0_NOT_WDTWV_SIZE                     equ 0001h
PCON0_NOT_WDTWV_LENGTH                   equ 0001h
PCON0_NOT_WDTWV_MASK                     equ 0020h
PCON0_nBOR_POSN                          equ 0000h
PCON0_nBOR_POSITION                      equ 0000h
PCON0_nBOR_SIZE                          equ 0001h
PCON0_nBOR_LENGTH                        equ 0001h
PCON0_nBOR_MASK                          equ 0001h
PCON0_nPOR_POSN                          equ 0001h
PCON0_nPOR_POSITION                      equ 0001h
PCON0_nPOR_SIZE                          equ 0001h
PCON0_nPOR_LENGTH                        equ 0001h
PCON0_nPOR_MASK                          equ 0002h
PCON0_nRI_POSN                           equ 0002h
PCON0_nRI_POSITION                       equ 0002h
PCON0_nRI_SIZE                           equ 0001h
PCON0_nRI_LENGTH                         equ 0001h
PCON0_nRI_MASK                           equ 0004h
PCON0_nRMCLR_POSN                        equ 0003h
PCON0_nRMCLR_POSITION                    equ 0003h
PCON0_nRMCLR_SIZE                        equ 0001h
PCON0_nRMCLR_LENGTH                      equ 0001h
PCON0_nRMCLR_MASK                        equ 0008h
PCON0_nRWDT_POSN                         equ 0004h
PCON0_nRWDT_POSITION                     equ 0004h
PCON0_nRWDT_SIZE                         equ 0001h
PCON0_nRWDT_LENGTH                       equ 0001h
PCON0_nRWDT_MASK                         equ 0010h
PCON0_nWDTWV_POSN                        equ 0005h
PCON0_nWDTWV_POSITION                    equ 0005h
PCON0_nWDTWV_SIZE                        equ 0001h
PCON0_nWDTWV_LENGTH                      equ 0001h
PCON0_nWDTWV_MASK                        equ 0020h
PCON0_STKUNF_POSN                        equ 0006h
PCON0_STKUNF_POSITION                    equ 0006h
PCON0_STKUNF_SIZE                        equ 0001h
PCON0_STKUNF_LENGTH                      equ 0001h
PCON0_STKUNF_MASK                        equ 0040h
PCON0_STKOVF_POSN                        equ 0007h
PCON0_STKOVF_POSITION                    equ 0007h
PCON0_STKOVF_SIZE                        equ 0001h
PCON0_STKOVF_LENGTH                      equ 0001h
PCON0_STKOVF_MASK                        equ 0080h
PCON0_BOR_POSN                           equ 0000h
PCON0_BOR_POSITION                       equ 0000h
PCON0_BOR_SIZE                           equ 0001h
PCON0_BOR_LENGTH                         equ 0001h
PCON0_BOR_MASK                           equ 0001h
PCON0_POR_POSN                           equ 0001h
PCON0_POR_POSITION                       equ 0001h
PCON0_POR_SIZE                           equ 0001h
PCON0_POR_LENGTH                         equ 0001h
PCON0_POR_MASK                           equ 0002h
PCON0_RI_POSN                            equ 0002h
PCON0_RI_POSITION                        equ 0002h
PCON0_RI_SIZE                            equ 0001h
PCON0_RI_LENGTH                          equ 0001h
PCON0_RI_MASK                            equ 0004h
PCON0_RMCLR_POSN                         equ 0003h
PCON0_RMCLR_POSITION                     equ 0003h
PCON0_RMCLR_SIZE                         equ 0001h
PCON0_RMCLR_LENGTH                       equ 0001h
PCON0_RMCLR_MASK                         equ 0008h
PCON0_RWDT_POSN                          equ 0004h
PCON0_RWDT_POSITION                      equ 0004h
PCON0_RWDT_SIZE                          equ 0001h
PCON0_RWDT_LENGTH                        equ 0001h
PCON0_RWDT_MASK                          equ 0010h
PCON0_WDTWV_POSN                         equ 0005h
PCON0_WDTWV_POSITION                     equ 0005h
PCON0_WDTWV_SIZE                         equ 0001h
PCON0_WDTWV_LENGTH                       equ 0001h
PCON0_WDTWV_MASK                         equ 0020h

// Register: PCON1
#define PCON1 PCON1
PCON1                                    equ 04F1h
// bitfield definitions
PCON1_NOT_RCM_POSN                       equ 0000h
PCON1_NOT_RCM_POSITION                   equ 0000h
PCON1_NOT_RCM_SIZE                       equ 0001h
PCON1_NOT_RCM_LENGTH                     equ 0001h
PCON1_NOT_RCM_MASK                       equ 0001h
PCON1_NOT_MEMV_POSN                      equ 0001h
PCON1_NOT_MEMV_POSITION                  equ 0001h
PCON1_NOT_MEMV_SIZE                      equ 0001h
PCON1_NOT_MEMV_LENGTH                    equ 0001h
PCON1_NOT_MEMV_MASK                      equ 0002h
PCON1_NOT_RVREG_POSN                     equ 0002h
PCON1_NOT_RVREG_POSITION                 equ 0002h
PCON1_NOT_RVREG_SIZE                     equ 0001h
PCON1_NOT_RVREG_LENGTH                   equ 0001h
PCON1_NOT_RVREG_MASK                     equ 0004h
PCON1_nRCM_POSN                          equ 0000h
PCON1_nRCM_POSITION                      equ 0000h
PCON1_nRCM_SIZE                          equ 0001h
PCON1_nRCM_LENGTH                        equ 0001h
PCON1_nRCM_MASK                          equ 0001h
PCON1_nMEMV_POSN                         equ 0001h
PCON1_nMEMV_POSITION                     equ 0001h
PCON1_nMEMV_SIZE                         equ 0001h
PCON1_nMEMV_LENGTH                       equ 0001h
PCON1_nMEMV_MASK                         equ 0002h
PCON1_nRVREG_POSN                        equ 0002h
PCON1_nRVREG_POSITION                    equ 0002h
PCON1_nRVREG_SIZE                        equ 0001h
PCON1_nRVREG_LENGTH                      equ 0001h
PCON1_nRVREG_MASK                        equ 0004h
PCON1_MEMV_POSN                          equ 0001h
PCON1_MEMV_POSITION                      equ 0001h
PCON1_MEMV_SIZE                          equ 0001h
PCON1_MEMV_LENGTH                        equ 0001h
PCON1_MEMV_MASK                          equ 0002h

